<template>
  <div class="demo">
    <h3>单行文本超出省略号（v-ellipsis）</h3>
    <div v-ellipsis>
      这十年，以新发展理念为引领，中国经济在壮阔海域中开拓出更加光明的高质量发展新航程。“嫦娥”探月、“祝融”探火、“羲和”逐日，不曾停歇的叩问苍穹脚步见证“中国高度”；北京大兴国际机场凤凰展翅、港珠澳大桥飞架三地，一项项重大工程彰显“中国速度”；“奋斗者”号成功坐底万米海底，“深海一号”成为全球首座10万吨级深水半潜式生产储油平台，不断刷新的纪录标注“中国深度”……从这一系列标志性成果可以感受到中国经济转型升级的强大脉搏，产业升级势头强劲，创新发展态势持续，经济结构调整优化，绿色转型稳步推进，民生改善继续加强。可以说，中国经济不仅有量的合理增长，还有质的稳步提升，更有结构的持续优化，在保持中高速奔跑的同时，“体格”更强健、“含金量”更充足。
    </div>

    <h3>多行文本超出省略号（v-ellipsis:2）</h3>
    <div v-ellipsis:2>
      这十年，以新发展理念为引领，中国经济在壮阔海域中开拓出更加光明的高质量发展新航程。“嫦娥”探月、“祝融”探火、“羲和”逐日，不曾停歇的叩问苍穹脚步见证“中国高度”；北京大兴国际机场凤凰展翅、港珠澳大桥飞架三地，一项项重大工程彰显“中国速度”；“奋斗者”号成功坐底万米海底，“深海一号”成为全球首座10万吨级深水半潜式生产储油平台，不断刷新的纪录标注“中国深度”……从这一系列标志性成果可以感受到中国经济转型升级的强大脉搏，产业升级势头强劲，创新发展态势持续，经济结构调整优化，绿色转型稳步推进，民生改善继续加强。可以说，中国经济不仅有量的合理增长，还有质的稳步提升，更有结构的持续优化，在保持中高速奔跑的同时，“体格”更强健、“含金量”更充足。这十年，以新发展理念为引领，中国经济在壮阔海域中开拓出更加光明的高质量发展新航程。“嫦娥”探月、“祝融”探火、“羲和”逐日，不曾停歇的叩问苍穹脚步见证“中国高度”；北京大兴国际机场凤凰展翅、港珠澳大桥飞架三地，一项项重大工程彰显“中国速度”；“奋斗者”号成功坐底万米海底，“深海一号”成为全球首座10万吨级深水半潜式生产储油平台，不断刷新的纪录标注“中国深度”……从这一系列标志性成果可以感受到中国经济转型升级的强大脉搏，产业升级势头强劲，创新发展态势持续，经济结构调整优化，绿色转型稳步推进，民生改善继续加强。可以说，中国经济不仅有量的合理增长，还有质的稳步提升，更有结构的持续优化，在保持中高速奔跑的同时，“体格”更强健、“含金量”更充足。
    </div>
  </div>
</template>

<script>
export default {
  name: "ellipsis",
};
</script>

<style scoped>
h3 {
  margin: 20px 0;
}
</style>
